06_sloshingBaffleVid/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2306                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    tank_wall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          14852;
        startFace       421730;
    }
    bafflenya_master
    {
        type            wall;
        inGroups        2(wall bafflenya);
        nFaces          11472;
        startFace       436582;
    }
    bafflenya_slave
    {
        type            wall;
        inGroups        2(wall bafflenya);
        nFaces          11472;
        startFace       448054;
    }
)

// ************************************************************************* //
