06_sloshingBaffleVid/system/createBafflesDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      createBafflesDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

internalFacesOnly true;

baffles
{
    bafflenya
    {
        //- Use predefined faceZone to select faces and orientation.
        type        faceZone;
        zoneName    bafflenya;

        patchPairs
        {
            type            wall;

            patchFields
            {
                epsilon
                {
                    type            epsilonWallFunction;
					value           uniform 0.1;
                }
                k
                {
                    type            kqRWallFunction;
					value           uniform 0.1;
                }
                nut
                {
                    type            nutkWallFunction;
					value           uniform 0;
                }
                nuTilda
                {
                    type            zeroGradient;
                }
                p_rgh
                {
                    type            fixedFluxPressure;
					value           uniform 0;
                }
                U
                {
                    type            noSlip;
                }
				alpha.water
				{
					type			zeroGradient;
				}
            }
        }
    }

}


// ************************************************************************* //
